HHHYUBO/STM32F407_Project/MyFanCode/bsp/w25qxx.h
#ifndef __W25QXX_H
#define __W25QXX_H

#include "stm32f4xx.h"
#include "spi.h"
#include <stdio.h>
#include <stdlib.h>

/* W25QXX芯片型号定义 */
#define W25Q80  0xEF13
#define W25Q16  0xEF14
#define W25Q32  0xEF15
#define W25Q64  0xEF16
#define W25Q128 0xEF17

/* W25QXX指令表 */
#define W25X_WriteEnable       0x06
#define W25X_WriteDisable      0x04
#define W25X_ReadStatusReg1    0x05
#define W25X_ReadStatusReg2    0x35
#define W25X_ReadStatusReg3    0x15
#define W25X_WriteStatusReg1   0x01
#define W25X_WriteStatusReg2   0x31
#define W25X_WriteStatusReg3   0x11
#define W25X_ReadData          0x03
#define W25X_FastReadData      0x0B
#define W25X_FastReadDual      0x3B
#define W25X_PageProgram       0x02
#define W25X_BlockErase        0xD8
#define W25X_SectorErase       0x20
#define W25X_ChipErase         0xC7
#define W25X_PowerDown         0xB9
#define W25X_ReleasePowerDown  0xAB
#define W25X_DeviceID          0xAB
#define W25X_ManufactDeviceID  0x90
#define W25X_JedecDeviceID     0x9F

extern uint8_t WriteBuffer[];
extern uint8_t ReadBuffer[];

/* 外部可调用函数 */
void W25QXX_Init(void);                                                 // 初始化W25QXX
uint16_t W25QXX_ReadID(void);                                           // 读取FLASH ID
void W25QXX_Read(uint8_t* pBuffer, uint32_t ReadAddr, uint16_t NumByteToRead);   // 读取SPI FLASH
uint8_t W25QXX_Write(uint8_t* pBuffer, uint32_t WriteAddr, uint16_t NumByteToWrite); // 写SPI FLASH
void W25QXX_Erase_Chip(void);                                           // 擦除整个芯片
void W25QXX_Erase_Sector(uint32_t Dst_Addr);                            // 擦除一个扇区
void W25QXX_Erase_Block(uint32_t Dst_Addr);                             // 擦除一个块
void W25QXX_PowerDown(void);                                            // 进入掉电模式
void W25QXX_WAKEUP(void);                                               // 唤醒

void W25QXX_Test(void);

/* 内部调用函数 */
uint8_t W25QXX_ReadSR(uint8_t regno);                                   // 读取状态寄存器
void W25QXX_Write_SR(uint8_t regno, uint8_t sr);                        // 写状态寄存器
void W25QXX_Write_Enable(void);                                         // 写使能
void W25QXX_Write_Disable(void);                                        // 写禁止
void W25QXX_Write_Page(uint8_t* pBuffer, uint32_t WriteAddr, uint16_t NumByteToWrite); // 写页
void W25QXX_Write_NoCheck(uint8_t* pBuffer, uint32_t WriteAddr, uint16_t NumByteToWrite); // 无检验写
void W25QXX_Wait_Busy(void);                                            // 等待空闲

/* 外部变量声明 */
extern uint16_t W25QXX_TYPE;                                            // W25QXX芯片型号

#endif /* __W25QXX_H */
